/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer:

Higher-Order คือฟังก์ชั่นตัวกลาง ที่ใช้ในการเรียกฟังก์ชั่น Callback อื่นมาทำงาน โดยสามารถเพิ่มการทำงานที่ซับซ้อนขึ้นได้ 


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer:
อ่านง่ายขึ้น เพราะ มีการสร้างฟังก์ชั่น callback ฟังชั่น ที่สื่อความหมายเจาะจงกับการเรียกใช้สถานะต่างๆ

3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  
Higher-Order คือฟังก์ชั่นตัวกลางที่เราจะใช้เรียก โดยสามารถนำฟังก์ชั่นย่อย(callback)มาเรียกใช้ สามารถส่ง อากิวเม้นเพิ่มเติมเพื่อให้ callback แต่ละตัวทำงานและคืนค่าได้

*/
